In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({"key":list("bbacab"),
                   "data1":range(6)})
df2 = pd.DataFrame({"key":list("ababd"),
                   "data2":range(5)})

In [4]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [6]:
pd.merge(df1, df2, on="key", how="left")

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [7]:
pd.merge(df1, df2, on="key", how="inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [11]:
s1 = pd.Series([0, 1], index = ["a", "b"])
s2 = pd.Series([2,3,4], index=["c", "d", "e"])
s3 = pd.Series([5,6], index=["f", "g"])

In [12]:
s1

a    0
b    1
dtype: int64

In [13]:
s2

c    2
d    3
e    4
dtype: int64

In [14]:
s3

f    5
g    6
dtype: int64

In [15]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [17]:
pd.concat([s1, s2, s3], axis=1) # 열 방향으로

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [18]:
s4 = pd.concat([s1 *5, s3])

In [19]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [20]:
s1

a    0
b    1
dtype: int64

In [21]:
pd.concat([s1,s2,s3], axis=1, keys=["one", "two", "three"])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0